content/blog.org
#+hugo_base_dir: ../
#+hugo_section: posts


** DONE Práctica 3.4 — Clases, herencia y coches
CLOSED: [2026-03-23 Sat 12:00]
:PROPERTIES:
:EXPORT_FILE_NAME: practica-herencia-coches
:EXPORT_HUGO_SECTION: posts
:EXPORT_HUGO_PUBLISHDATE: 2026-03-23
:EXPORT_HUGO_URL: /poo4/
:EXPORT_HUGO_TAGS: prácticas
:END:

*** Tabla de Contenidos

1. [[*Herencia][Herencia]]
2. [[*El metodo =__init__()= en una Clase Hija][El metodo __init__() en una Clase Hija]]
3. [[*Definir Atributos y Metodos para la Clase Hija][Definir Atributos y Metodos para la Clase Hija]]
4. [[*Instancias como Atributos][Instancias como Atributos]]
5. [[*Añadir mas detalle a la clase =Bateria=][Añadir mas detalle a la clase Bateria]]
6. [[*Resumen de Conceptos][Resumen de Conceptos]]
7. [[*Diagrama de la Jerarquia][Diagrama de la Jerarquia]]
8. [[*Progresion del codigo — las 4 versiones][Progresion del codigo]]

*** Herencia

Cuando escribes clases no siempre tienes que partir de cero. Si la
clase que estas escribiendo es una *version especializada* de otra
clase que ya has escrito, puedes usar *herencia*. Cuando una clase
/hereda/ de otra, adquiere automaticamente todos los atributos y
metodos de la clase original. La clase original se llama *clase padre*
(o /parent class/), y la nueva clase es la *clase hija* (o /child
class/).

La clase hija hereda cada atributo y metodo de su padre, pero tambien
es libre de *definir atributos y metodos nuevos* propios.

#+begin_quote
*Continuidad:* En la Practica 3.3 construimos la clase =Coche= y la
clase =NaveEspacial= para dominar la mecanica de clases, atributos y
metodos. Ahora vamos a *reutilizar* la clase =Coche= como padre para
crear un tipo mas especifico: el *coche electrico*.
#+end_quote

*** El metodo =__init__()= en una Clase Hija

Cuando escribes una clase hija, lo primero que Python necesita hacer
es *inicializar los atributos de la clase padre*. Para ello, el
metodo =__init__()= de la clase hija llama al =__init__()= del padre.

Vamos a modelar un coche electrico. Un =CocheElectrico= es una
version especializada de =Coche=, asi que podemos basar =CocheElectrico=
en la clase =Coche= que ya tenemos y centrar nuestra codificacion
solamente en los atributos y comportamientos especificos de los
coches electricos.

**** Version 0 — La herencia mas basica

Empecemos creando una version sencilla de =CocheElectrico= que haga
todo lo que puede hacer =Coche=:

#+begin_src python
class Coche:
    """Intento sencillo de representar un coche."""

    def __init__(self, fabricante, modelo, año):
        """Inicializa los atributos para describir un coche."""
        self.fabricante = fabricante
        self.modelo = modelo
        self.año = año
        self.cuentakilometros_lectura = 0

    def nombra_descriptivamente(self):
        """Devuelve un nombre descriptivo con formato legible."""
        nombre_descriptivo = f"{self.año} {self.fabricante} {self.modelo}"
        return nombre_descriptivo.title()

    def lee_cuentakilometros(self):
        """Imprime el kilometraje del coche."""
        print(f"Este coche ha recorrido {self.cuentakilometros_lectura} kilometros.")

    def update_cuentakilometros(self, kilometraje):
        """Establece la lectura del cuentakilometros al valor dado."""
        if kilometraje >= self.cuentakilometros_lectura:
            self.cuentakilometros_lectura = kilometraje
        else:
            print("¡No puedes retroceder el cuentakilometros!")

    def incrementa_cuentakilometros(self, kms):
        """Suma la cantidad dada a la lectura del cuentakilometros."""
        self.cuentakilometros_lectura += kms


class CocheElectrico(Coche):
    """Representa aspectos de un coche especificos de vehiculos electricos."""

    def __init__(self, fabricante, modelo, año):
        """Inicializa los atributos de la clase padre."""
        super().__init__(fabricante, modelo, año)


mi_leaf = CocheElectrico('nissan', 'leaf', 2024)
print(mi_leaf.nombra_descriptivamente())
#+end_src

#+begin_example
2024 Nissan Leaf
#+end_example

***** Que ocurre aqui

- Empezamos con =Coche=. Cuando creas una clase hija, la clase padre debe estar definida *antes* en el mismo archivo. Aqui situamos =Coche= primero.
- Definimos la clase hija: =CocheElectrico=. El nombre de la clase padre debe ir *entre parentesis* en la definicion de la clase hija: =class CocheElectrico(Coche):=
- La funcion =super()= es una funcion especial que permite *llamar a un metodo de la clase padre*. La linea =super().__init__(fabricante, modelo, año)= le dice a Python que llame al =__init__()= de =Coche=, lo que da a =CocheElectrico= todos los atributos definidos en el padre. El nombre =super= viene de la convencion de llamar a la clase padre /superclase/ y a la hija /subclase/.
- Probamos que la herencia funciona creando un coche electrico con los argumentos ='nissan'=, ='leaf'= y =2024=. Llamamos a =nombra_descriptivamente()=, que esta definida en =Coche= pero esta disponible en cualquier instancia de =CocheElectrico=.

#+begin_quote
*En resumen:* aparte de =__init__()=, todavia no hay atributos ni metodos propios de un coche electrico. De momento, solo estamos comprobando que la herencia funciona correctamente.
#+end_quote

*** Definir Atributos y Metodos para la Clase Hija

Una vez que tienes una clase hija que hereda de la padre, puedes
añadir cualquier *atributo y metodo nuevo* que sea necesario para
diferenciar la clase hija de la padre.

Vamos a añadir un atributo especifico de los coches electricos (el
tamaño de la bateria) y un metodo para informar sobre el.

**** Version 1 — Atributos y metodos propios de la clase hija

#+begin_src python
class Coche:
    """Intento sencillo de representar un coche."""

    def __init__(self, fabricante, modelo, año):
        """Inicializa los atributos para describir un coche."""
        self.fabricante = fabricante
        self.modelo = modelo
        self.año = año
        self.cuentakilometros_lectura = 0

    def nombra_descriptivamente(self):
        """Devuelve un nombre descriptivo con formato legible."""
        nombre_descriptivo = f"{self.año} {self.fabricante} {self.modelo}"
        return nombre_descriptivo.title()

    def lee_cuentakilometros(self):
        """Imprime el kilometraje del coche."""
        print(f"Este coche ha recorrido {self.cuentakilometros_lectura} kilometros.")

    def update_cuentakilometros(self, kilometraje):
        """Establece la lectura del cuentakilometros al valor dado."""
        if kilometraje >= self.cuentakilometros_lectura:
            self.cuentakilometros_lectura = kilometraje
        else:
            print("¡No puedes retroceder el cuentakilometros!")

    def incrementa_cuentakilometros(self, kms):
        """Suma la cantidad dada a la lectura del cuentakilometros."""
        self.cuentakilometros_lectura += kms


class CocheElectrico(Coche):
    """Representa aspectos de un coche especificos de vehiculos electricos."""

    def __init__(self, fabricante, modelo, año):
        """
        Inicializa los atributos de la clase padre.
        Despues inicializa los atributos especificos del coche electrico.
        """
        super().__init__(fabricante, modelo, año)
        self.tamaño_bateria = 40

    def describir_bateria(self):
        """Imprime una descripcion del tamaño de la bateria."""
        print(f"Este coche tiene una bateria de {self.tamaño_bateria} kWh.")


mi_leaf = CocheElectrico('nissan', 'leaf', 2024)
print(mi_leaf.nombra_descriptivamente())
mi_leaf.describir_bateria()
#+end_src

#+begin_example
2024 Nissan Leaf
Este coche tiene una bateria de 40 kWh.
#+end_example

