content/blog.org
***** Que ocurre aqui

- Añadimos el atributo =self.tamaño_bateria= y le asignamos un valor inicial de =40= (kWh). Este atributo se asociara a todas las instancias creadas a partir de =CocheElectrico= pero *no* a las instancias de =Coche=.
- Tambien añadimos el metodo =describir_bateria()=, que imprime informacion sobre la bateria. Este metodo solo estara disponible para instancias de =CocheElectrico=.
- No hay limite en cuanto puedes especializar la clase hija. Puedes añadir tantos atributos y metodos como necesites para modelar un coche electrico con la precision que quieras.

#+begin_quote
*Consejo de diseño:* Si un atributo o metodo pertenece a /cualquier/ coche, no solo a un coche electrico, deberia ir en =Coche= y no en =CocheElectrico=. Cualquiera que use la clase =Coche= obtendra esa funcionalidad, y la clase =CocheElectrico= solo contendra lo especifico de los vehiculos electricos.
#+end_quote

*** Instancias como Atributos

Al modelar objetos del mundo real en codigo, puedes encontrar que
estas añadiendo mas y mas detalle a una clase. Llega un momento en
que tus listas de atributos y metodos crecen tanto que es buena idea
*extraer parte de la clase en una clase separada*. Puedes dividir tu
clase grande en clases mas pequeñas que trabajen juntas; esta tecnica
se llama *composicion*.

Por ejemplo, si seguimos añadiendo detalles a la clase
=CocheElectrico=, podriamos acabar con muchos atributos y metodos
especificos de la bateria. Cuando eso ocurre, podemos parar y mover
esos atributos y metodos a una clase separada llamada =Bateria=.
Entonces usamos una instancia de =Bateria= como *atributo* de
=CocheElectrico=:

**** Version 2 — Instancias como atributos (composicion)

#+begin_src python
class Coche:
    """Intento sencillo de representar un coche."""

    def __init__(self, fabricante, modelo, año):
        """Inicializa los atributos para describir un coche."""
        self.fabricante = fabricante
        self.modelo = modelo
        self.año = año
        self.cuentakilometros_lectura = 0

    def nombra_descriptivamente(self):
        """Devuelve un nombre descriptivo con formato legible."""
        nombre_descriptivo = f"{self.año} {self.fabricante} {self.modelo}"
        return nombre_descriptivo.title()

    def lee_cuentakilometros(self):
        """Imprime el kilometraje del coche."""
        print(f"Este coche ha recorrido {self.cuentakilometros_lectura} kilometros.")

    def update_cuentakilometros(self, kilometraje):
        """Establece la lectura del cuentakilometros al valor dado."""
        if kilometraje >= self.cuentakilometros_lectura:
            self.cuentakilometros_lectura = kilometraje
        else:
            print("¡No puedes retroceder el cuentakilometros!")

    def incrementa_cuentakilometros(self, kms):
        """Suma la cantidad dada a la lectura del cuentakilometros."""
        self.cuentakilometros_lectura += kms


class Bateria:
    """Intento sencillo de modelar la bateria de un coche electrico."""

    def __init__(self, tamaño_bateria=40):
        """Inicializa los atributos de la bateria."""
        self.tamaño_bateria = tamaño_bateria

    def describir_bateria(self):
        """Imprime una descripcion del tamaño de la bateria."""
        print(f"Este coche tiene una bateria de {self.tamaño_bateria} kWh.")


class CocheElectrico(Coche):
    """Representa aspectos de un coche especificos de vehiculos electricos."""

    def __init__(self, fabricante, modelo, año):
        """
        Inicializa los atributos de la clase padre.
        Despues inicializa los atributos especificos del coche electrico.
        """
        super().__init__(fabricante, modelo, año)
        self.bateria = Bateria()


mi_leaf = CocheElectrico('nissan', 'leaf', 2024)
print(mi_leaf.nombra_descriptivamente())
mi_leaf.bateria.describir_bateria()
#+end_src

#+begin_example
2024 Nissan Leaf
Este coche tiene una bateria de 40 kWh.
#+end_example

***** Que ocurre aqui

- Definimos una nueva clase llamada =Bateria= que *no hereda de ninguna otra clase*. Su =__init__()= tiene un parametro =tamaño_bateria= con valor por defecto =40=. El metodo =describir_bateria()= tambien se ha movido aqui, desde =CocheElectrico=.
- En =CocheElectrico=, ahora añadimos un atributo =self.bateria=. Esta linea le dice a Python que cree una nueva instancia de =Bateria= (con el valor por defecto de 40 kWh) y la asigne al atributo =self.bateria=. Esto ocurrira *cada vez que se llame a* =__init__()=; cualquier instancia de =CocheElectrico= tendra automaticamente una instancia de =Bateria= asociada.
- Para acceder a los atributos de la bateria hay que usar *doble notacion de punto*: =mi_leaf.bateria.describir_bateria()=

#+begin_quote
*¿Por que composicion?* Esto puede parecer mucho trabajo extra. Pero ahora puedes describir la bateria con todo el detalle que quieras *sin ensuciar* la clase =CocheElectrico=. Ademas, la clase =Bateria= es reutilizable: podria usarse en una moto electrica, un patinete, o cualquier otro vehiculo.
#+end_quote

*** Añadir mas detalle a la clase =Bateria=

Cuando la bateria es su propia clase, es natural seguir
enriqueciendola. Vas a añadir tu mismo/a un metodo =obtener_autonomia()= que
informe de la distancia que el coche puede recorrer segun el tamaño
de la bateria:

*** Objetivo de la practica : ampliar las caracteristicas del coche

**** Inventa una Version 3 que implemente sobre la Version 2 un Metodo =obtener_autonomia()=

#+begin_quote
*Tu tarea:* Estudia cada version, ejecutala, modificala.
Experimenta cambiando valores, añadiendo metodos, creando nuevas
subclases. La mejor forma de aprender POO es /romper cosas y
arreglarlas/.
#+end_quote

#+begin_quote
*Reflexion sobre el diseño:* En este punto podemos preguntarnos:
¿Donde deberia vivir un metodo como =obtener_autonomia()=? ¿En
=CocheElectrico= o en =Bateria=? Si la autonomia depende *solo* del
tamaño de la bateria, entonces pertenece a =Bateria=. Pero si la
autonomia tambien dependiera del peso del coche, la aerodinamica, o
el tipo de neumaticos... entonces quiza =CocheElectrico= seria mejor
lugar. El arte de decidir donde poner cada metodo es lo que hace la
POO interesante.
#+end_quote

Demuestra tu arte como programador/a,

- Ampliando unas 2 o 3 caracteristicas del vehiculo usando el concepto de *herencia*. Inspirate en como hemos hecho con la bateria.

*** Resumen de Conceptos

| *Concepto*                    | *Descripcion*                                  | *Ejemplo*                                              |
|-------------------------------+------------------------------------------------+--------------------------------------------------------|
| *Herencia*                    | Una clase hija adquiere atributos/metodos del padre | =class CocheElectrico(Coche):=                    |
| *Clase padre (superclase)*    | La clase original de la que se hereda          | =Coche=                                                |
| *Clase hija (subclase)*       | La nueva clase que hereda y especializa        | =CocheElectrico=                                       |
| *=super()=*                   | Llama a un metodo de la clase padre            | =super().__init__(fabricante, modelo, año)=             |
| *Atributo propio de la hija*  | Atributo que solo existe en la subclase        | =self.tamaño_bateria = 40=                             |
| *Metodo propio de la hija*    | Metodo exclusivo de la subclase                | =describir_bateria()=                                  |
| *Composicion*                 | Usar una instancia de otra clase como atributo | =self.bateria = Bateria()=                             |
| *Doble notacion de punto*     | Acceder a atributos de un objeto anidado       | =mi_leaf.bateria.describir_bateria()=                  |

