content/posts/practica-herencia-coches.md


## Diagrama de la Jerarquia {#diagrama-de-la-jerarquia}

```text
 ┌─────────────┐
 │   Coche     │  ← clase padre (superclase)
 │─────────────│
 │ fabricante  │
 │ modelo      │
 │ año         │
 │ cuentakm    │
 │─────────────│
 │ nombra..()  │
 │ lee_ckm()   │
 │ update_ckm()│
 │ increm_ckm()│
 └──────┬──────┘
        │ hereda
        ▼
┌───────────────┐
│CocheElectrico │  ← clase hija (subclase)
│───────────────│
│ bateria ──────┼──────┐
│───────────────│      │ composicion
│               │      ▼
└───────────────┘  ┌──────────┐
                   │ Bateria  │
                   │──────────│
                   │ tamaño   │
                   │──────────│
                   │ describir│
                   │ autonomia│
                   └──────────┘
```


## Progresion del codigo — las 4 versiones {#progresion-del-codigo-las-4-versiones}

A continuacion tienes un resumen de como hemos ido construyendo el
codigo, paso a paso:

| **Version** | **Fichero**              | **Que añade**                                        |
|-------------|--------------------------|------------------------------------------------------|
| **v0**      | `coche_electrico_v0.py`  | Herencia basica: `CocheElectrico(Coche)` + `super()` |
| **v1**      | `coche_electrico_v1.py`  | Atributo (`tamaño_bateria`) y metodo propios         |
| **v2**      | `coche_electrico_v2.py`  | Composicion: clase `Bateria` como atributo           |
|             | A Crear por Ti           | Caracteristicas adicionales del vehiculo.            |
| **v3**      | `coche_electrico_v3.py?` | Metodo `obtener_autonomia()` en `Bateria` ?          |

Happy coding !
